; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-6nodes-1000size-4degree-100mindistance-4trucks-3packages-909seed

(define (problem transport-two-cities-sequential-6nodes-1000size-4degree-100mindistance-4trucks-3packages-909seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 406,664 -> 210,679
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 20)
  ; 210,679 -> 406,664
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 20)
  ; 781,639 -> 406,664
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 38)
  ; 406,664 -> 781,639
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 38)
  ; 781,639 -> 834,218
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 43)
  ; 834,218 -> 781,639
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 43)
  ; 296,384 -> 210,679
  (road city-1-loc-6 city-1-loc-1)
  (= (road-length city-1-loc-6 city-1-loc-1) 31)
  ; 210,679 -> 296,384
  (road city-1-loc-1 city-1-loc-6)
  (= (road-length city-1-loc-1 city-1-loc-6) 31)
  ; 296,384 -> 406,664
  (road city-1-loc-6 city-1-loc-2)
  (= (road-length city-1-loc-6 city-1-loc-2) 31)
  ; 406,664 -> 296,384
  (road city-1-loc-2 city-1-loc-6)
  (= (road-length city-1-loc-2 city-1-loc-6) 31)
  ; 296,384 -> 242,9
  (road city-1-loc-6 city-1-loc-4)
  (= (road-length city-1-loc-6 city-1-loc-4) 38)
  ; 242,9 -> 296,384
  (road city-1-loc-4 city-1-loc-6)
  (= (road-length city-1-loc-4 city-1-loc-6) 38)
  ; 296,384 -> 781,639
  (road city-1-loc-6 city-1-loc-5)
  (= (road-length city-1-loc-6 city-1-loc-5) 55)
  ; 781,639 -> 296,384
  (road city-1-loc-5 city-1-loc-6)
  (= (road-length city-1-loc-5 city-1-loc-6) 55)
  ; 2526,499 -> 2689,416
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 19)
  ; 2689,416 -> 2526,499
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 19)
  ; 2242,475 -> 2689,416
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 46)
  ; 2689,416 -> 2242,475
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 46)
  ; 2242,475 -> 2526,499
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 29)
  ; 2526,499 -> 2242,475
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 29)
  ; 2820,744 -> 2689,416
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 36)
  ; 2689,416 -> 2820,744
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 36)
  ; 2820,744 -> 2526,499
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 39)
  ; 2526,499 -> 2820,744
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 39)
  ; 2964,569 -> 2689,416
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 32)
  ; 2689,416 -> 2964,569
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 32)
  ; 2964,569 -> 2526,499
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 45)
  ; 2526,499 -> 2964,569
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 45)
  ; 2964,569 -> 2820,744
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 23)
  ; 2820,744 -> 2964,569
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 23)
  ; 2065,687 -> 2526,499
  (road city-2-loc-6 city-2-loc-2)
  (= (road-length city-2-loc-6 city-2-loc-2) 50)
  ; 2526,499 -> 2065,687
  (road city-2-loc-2 city-2-loc-6)
  (= (road-length city-2-loc-2 city-2-loc-6) 50)
  ; 2065,687 -> 2242,475
  (road city-2-loc-6 city-2-loc-3)
  (= (road-length city-2-loc-6 city-2-loc-3) 28)
  ; 2242,475 -> 2065,687
  (road city-2-loc-3 city-2-loc-6)
  (= (road-length city-2-loc-3 city-2-loc-6) 28)
  ; 781,639 <-> 2065,687
  (road city-1-loc-5 city-2-loc-6)
  (= (road-length city-1-loc-5 city-2-loc-6) 129)
  (road city-2-loc-6 city-1-loc-5)
  (= (road-length city-2-loc-6 city-1-loc-5) 129)
  (at package-1 city-1-loc-5)
  (at package-2 city-1-loc-6)
  (at package-3 city-1-loc-4)
  (at truck-1 city-2-loc-2)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-4)
  (at truck-3 city-2-loc-6)
  (capacity truck-3 capacity-2)
  (at truck-4 city-2-loc-1)
  (capacity truck-4 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-5)
  (at package-2 city-2-loc-5)
  (at package-3 city-2-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-2 city-2-loc-6)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-6)
   goals met: 0 of 3
2. (drive truck-2 city-2-loc-6 city-1-loc-5)
   deleted: (at truck-2 city-2-loc-6)
   added: (at truck-2 city-1-loc-5)
   goals met: 0 of 3
3. (pick-up truck-2 city-1-loc-5 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-1-loc-5) (capacity truck-2 capacity-4)
   added: (in package-1 truck-2) (capacity truck-2 capacity-3)
   goals met: 0 of 3
4. (drive truck-2 city-1-loc-5 city-1-loc-6)
   deleted: (at truck-2 city-1-loc-5)
   added: (at truck-2 city-1-loc-6)
   goals met: 0 of 3
5. (pick-up truck-2 city-1-loc-6 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-6) (capacity truck-2 capacity-3)
   added: (in package-2 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 3
6. (drive truck-2 city-1-loc-6 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-6)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 3
7. (pick-up truck-2 city-1-loc-4 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-1-loc-4) (capacity truck-2 capacity-2)
   added: (in package-3 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 3
8. (drive truck-2 city-1-loc-4 city-1-loc-6)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-6)
   goals met: 0 of 3
9. (drive truck-2 city-1-loc-6 city-1-loc-5)
   deleted: (at truck-2 city-1-loc-6)
   added: (at truck-2 city-1-loc-5)
   goals met: 0 of 3
10. (drive truck-2 city-1-loc-5 city-2-loc-6)
   deleted: (at truck-2 city-1-loc-5)
   added: (at truck-2 city-2-loc-6)
   goals met: 0 of 3
11. (drive truck-2 city-2-loc-6 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-6)
   added: (at truck-2 city-2-loc-3)
   goals met: 0 of 3
12. (drop truck-2 city-2-loc-3 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-1)
   added: (at package-3 city-2-loc-3) (capacity truck-2 capacity-2)
   goals met: 1 of 3
13. (drive truck-2 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-1)
   goals met: 1 of 3
14. (drive truck-2 city-2-loc-1 city-2-loc-5)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-5)
   goals met: 1 of 3
15. (drop truck-2 city-2-loc-5 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-2)
   added: (at package-1 city-2-loc-5) (capacity truck-2 capacity-3)
   goals met: 2 of 3
16. (drop truck-2 city-2-loc-5 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-3)
   added: (at package-2 city-2-loc-5) (capacity truck-2 capacity-4)
   goals met: 3 of 3
